{
  "meta": {
    "version": "1.0",
    "author": "SpEdGalexii",
    "description": "GoalBank for secondary students (7-9). 30 goals per category."
  },
  "categories": {
    "English": [
      "By the end of the IEP period, given a teacher-selected grade-level informational passage and a graphic organizer, the student will identify the main idea and 3 supporting details with 80% accuracy across 4 out of 5 trials.",
      "Within 12 months, when given a curriculum-aligned listening task, the student will verbally summarize key points using at least 5 content-specific vocabulary terms with 4 out of 5 accuracy as measured by teacher rubric.",
      "By the end of the IEP, given explicit instruction and modeling in text structure, the student will classify paragraphs as description, sequence, cause/effect, or problem/solution with 80% accuracy on weekly checks.",
      "Within 12 months, given teacher prompts and sentence frames, the student will write an objective summary of a 2-paragraph text using 4-6 sentences, including main idea and two supporting details, on 3 of 4 writing samples.",
      "By the end of the IEP period, during small-group discussions, the student will contribute relevant, on-topic comments at least 3 times per session on 4 of 5 monitored sessions.",
      "Within the IEP year, when given instruction in paragraph organization, the student will write a coherent paragraph with topic sentence, 3 supporting sentences, and a concluding sentence on 3 of 4 graded prompts.",
      "By the end of the IEP, the student will follow multi-step oral directions (3 steps) in the classroom setting with no more than one teacher prompt in 4 out of 5 opportunities.",
      "Within 12 months, when provided visual supports and checklists, the student will independently edit written work to correct capitalization and end punctuation with 90% accuracy across 4 out of 5 samples.",
      "By the next progress report, given a teacher modeling of inference strategies, the student will infer a character’s motive from text evidence in 3 out of 4 passages.",
      "Within the IEP period, when given a research prompt and scaffolded note-taking guide, the student will produce a 3-paragraph report with 3 cited sources and accurate paraphrasing on 3 of 4 assignments.",
      "By the end of the IEP, the student will demonstrate active reading strategies (annotation, margin notes) during independent reading for 20 minutes with documented use in 4 of 5 sessions.",
      "Within 12 months, given explicit vocabulary instruction, the student will accurately use 12 target academic words in written responses with 80% accuracy across 4 of 5 assessments.",
      "By the end of the IEP period, when provided with supports, the student will identify author's purpose (inform, persuade, entertain) with 85% accuracy across 4 out of 5 selections.",
      "Within 12 months, given modeling and sentence starters, the student will produce 5 relevant questions about a text and use two to guide a short group discussion on 3 out of 4 observations.",
      "By the end of the IEP, during timed reading activities, the student will increase reading stamina to 30 minutes of sustained reading with 75% on-task behavior across 3 of 4 sessions.",
      "Within 12 months, when provided choice of topics and scaffolds, the student will complete a narrative writing piece containing descriptive sensory details and temporal sequence on 3 of 4 assignments.",
      "By the end of the IEP period, during literature circles, the student will summarize plot events in sequential order with 90% accuracy across 4 of 5 meetings.",
      "Within 12 months, given peer review training, the student will provide two constructive, text-based comments during peer editing sessions in 4 of 5 opportunities.",
      "By the end of the IEP, when using a rubric, the student will self-assess written work and identify two strengths and one goal for improvement on 3 out of 4 assignments.",
      "Within the IEP year, provided with reading scaffolds, the student will decode multisyllabic grade-level words with 85% accuracy across 4 of 5 word lists.",
      "By the end of the IEP, when given a choice board, the student will independently select and complete a reading response task, demonstrating comprehension, on 3 of 4 assignments.",
      "Within 12 months, during guided reading, the student will ask and answer literal and inferential questions about the text with 80% accuracy across 4 of 5 sessions.",
      "By the end of the IEP period, provided with repeated readings, the student will improve oral reading accuracy to 95% on grade-level passages across 3 of 4 probes.",
      "Within the IEP period, given explicit instruction in text-dependent analysis, the student will cite two pieces of text evidence to support a claim in 4 of 5 responses.",
      "By the end of the IEP, when given graphic organizers for compare/contrast, the student will correctly organize similarities and differences between two texts with 80% accuracy in 3 of 4 tasks.",
      "Within 12 months, given scaffolded choice and supports, the student will complete 4 research-based short projects with accurate bibliographic entries.",
      "By the end of the IEP, the student will use transitions (first, next, however) to connect ideas in multi-paragraph writing with 80% use across 3 of 4 samples.",
      "Within 12 months, when presented with poetry, the student will identify figurative language and explain its meaning in context with 75% accuracy across 4 of 5 poems.",
      "By the end of the IEP period, given instruction in tone and mood, the student will identify the author’s tone and provide two text clues supporting the selection in 4 of 5 passages."
    ],
    "Reading": [
      "By the end of the IEP period, when given grade-level passages and a comprehension checklist, the student will accurately answer literal comprehension questions with 85% accuracy across 4 of 5 probes.",
      "Within 12 months, given repeated reading practice, the student will increase words correct per minute (WCPM) by 15% on benchmark passages across three consecutive probes.",
      "By the end of the IEP, when provided with annotation scaffolds, the student will identify and underline key details and central idea in a paragraph with 80% accuracy on 4 of 5 assignments.",
      "Within 12 months, given explicit inference strategy instruction, the student will make an inference and cite one piece of text evidence with 75% accuracy across 4 of 5 tasks.",
      "By the end of the IEP period, during guided reading, the student will use context clues to determine the meaning of unknown vocabulary with 80% accuracy across 4 of 5 items.",
      "Within 12 months, when taught text structure markers, the student will identify signal words and summarize the text structure with 80% accuracy across weekly checks.",
      "By the end of the IEP, provided with targeted phonics instruction, the student will improve decoding accuracy on multisyllabic words to 85% across 4 of 5 lists.",
      "Within 12 months, given teacher modeling of summarization, the student will write a one-paragraph summary using main idea and two supporting details on 3 of 4 assessments.",
      "By the next progress report, when given a nonfiction article, the student will correctly identify the author's purpose with 80% accuracy on 4 of 5 samples.",
      "Within the IEP period, during text-dependent analysis tasks, the student will cite two pieces of evidence to support a claim in 3 of 4 responses.",
      "By the end of the IEP, when using comprehension question stems, the student will answer inferential questions with 70% accuracy across 4 of 5 probes.",
      "Within 12 months, given vocabulary instruction and practice, the student will use 15 academic words correctly in context on writing tasks across 4 of 5 assignments.",
      "By the end of the IEP period, during paired reading, the student will read aloud with 90% accuracy and demonstrate expression appropriate to punctuation on 3 of 4 sessions.",
      "Within 12 months, when provided with scaffolded note-taking templates, the student will extract main idea and three supporting facts from a text in 4 of 5 tasks.",
      "By the end of the IEP, the student will track comprehension by generating a main idea statement after independent reading in 4 of 5 observations.",
      "Within 12 months, when given tiered questions, the student will correctly answer higher-order (analysis/evaluation) questions with 65% accuracy across 4 of 5 prompts.",
      "By the end of the IEP period, during vocabulary instruction, the student will define and use contextual synonyms for 10 target words with 80% accuracy across 4 of 5 items.",
      "Within the IEP, when provided modeling for text structures, the student will compare and contrast two texts using a graphic organizer with 80% accuracy on 3 of 4 tasks.",
      "By the end of the IEP, during silent reading, the student will demonstrate active reading strategies and record comprehension notes in 4 of 5 sessions.",
      "Within 12 months, given systematic instruction in gist statements, the student will produce a 1-2 sentence gist for a paragraph with 85% accuracy across 4 of 5 checks.",
      "By the end of the IEP period, when given leveled passages, the student will correctly sequence plot events using a timeline with 90% accuracy on 3 of 4 tasks.",
      "Within 12 months, when taught monitoring strategies, the student will self-correct comprehension errors during reading with 80% frequency across monitored sessions.",
      "By the end of the IEP, during vocabulary quizzes, the student will show 80% mastery of 20 grade-appropriate words across 3 consecutive quizzes.",
      "Within 12 months, given partner discussion protocols, the student will contribute a text-based supporting idea during peer discussions in 4 of 5 opportunities.",
      "By the end of the IEP period, when given progressively complex texts, the student will demonstrate improved comprehension complexity level by advancing at least one reading level on a standardized measure.",
      "Within the IEP, when taught annotation strategies for nonfiction, the student will annotate an article with at least 4 meaningful notes demonstrating critical thinking on 3 of 4 tasks.",
      "By the end of the IEP period, when given a reading checklist, the student will independently use the checklist to verify comprehension before completing a response in 4 of 5 tasks.",
      "Within 12 months, when provided explicit main idea/summarizing routines, the student will create an accurate headline for a passage in 4 of 5 samples.",
      "By the end of the IEP, the student will synthesize information from two short texts to write a comparative paragraph with accurate supporting details on 3 of 4 assignments."
    ],
    "Writing": [
      "By the end of the IEP period, given a graphic organizer and extended time, the student will write a 3-paragraph essay with a clear introduction, two supporting paragraphs, and a conclusion with 3 of 4 rubric elements rated 'developing' or higher.",
      "Within 12 months, when provided sentence-level instruction and modeling, the student will produce compound and complex sentences in 70% of written sentences across 4 of 5 samples.",
      "By the end of the IEP, the student will use appropriate capitalization and punctuation with 90% accuracy in weekly editing exercises across 4 of 5 attempts.",
      "Within the IEP period, when provided with explicit instruction in paragraph cohesion, the student will use transitions to connect ideas in multi-paragraph writing with 80% effectiveness across 3 of 4 assignments.",
      "By the end of the IEP, given a rubric and model, the student will edit work to correct spelling errors in 95% of high-frequency words across 4 of 5 samples.",
      "Within 12 months, when taught writing planning strategies, the student will plan and produce a persuasive paragraph with a clear claim and two supporting reasons on 3 of 4 tasks.",
      "By the end of the IEP period, provided with sentence starters and graphic organizers, the student will independently produce a coherent narrative with logical sequence on 3 of 4 prompts.",
      "Within the IEP, when given teacher feedback cycles, the student will revise drafts to improve clarity and detail on 3 of 4 writing assignments.",
      "By the end of the IEP, when provided with editing checklists, the student will self-edit for grammar and produce cleaned drafts with <=3 errors in 4 of 5 samples.",
      "Within 12 months, given explicit instruction in thesis development, the student will write an introduction with a clear thesis statement in 3 of 4 essays.",
      "By the next progress report, when given mentor texts and guided practice, the student will incorporate descriptive sensory details in writing with 80% accuracy across 3 of 4 prompts.",
      "Within the IEP period, provided modeling of paragraph unity, the student will produce paragraphs with a single controlling idea and supporting sentences on 4 of 5 tasks.",
      "By the end of the IEP, when given scaffolds, the student will write a compare/contrast essay with clear organizational structure and evidence on 3 of 4 assignments.",
      "Within 12 months, when taught sentence combining strategies, the student will reduce run-on sentences by 75% across editing tasks.",
      "By the end of the IEP period, the student will write responses to literature that include a claim and two pieces of textual evidence in 4 out of 5 assignments.",
      "Within the IEP, when provided with timed practice and supports, the student will write a structured paragraph within 20 minutes with 80% of rubric elements met in 3 of 4 samples.",
      "By the end of the IEP, during peer review, the student will provide two specific, actionable suggestions for revision in 4 of 5 sessions.",
      "Within 12 months, given explicit instruction in conventions, the student will demonstrate correct subject-verb agreement in 90% of sentences across 4 of 5 samples.",
      "By the IEP end, when using scaffolds, the student will produce a research summary paragraph that paraphrases source information with correct citation format in 3 of 4 projects.",
      "Within 12 months, the student will independently apply an editing checklist to correct run-on sentences, punctuation, and capitalization with 85% accuracy across 4 of 5 drafts.",
      "By the end of the IEP period, given teacher modeling and templates, the student will compose an argumentative paragraph supporting a position with two well-explained reasons in 3 of 4 tasks.",
      "Within 12 months, when provided graphic organizers, the student will plan and write a multi-paragraph response that includes a counterargument and rebuttal on 3 of 4 assignments.",
      "By the end of the IEP, during guided editing, the student will use proofing symbols to identify and correct errors with 90% accuracy across 4 of 5 sessions.",
      "Within the IEP, when taught sentence-level fluency techniques, the student will increase sentence fluency (varied length and structure) in writing samples by a measurable rubric score across 3 of 4 tasks.",
      "By the end of the IEP period, provided with prompts and modeling, the student will produce a laboratory report with clear procedure, results, and conclusion in science class with 80% of criteria met.",
      "Within 12 months, when given explicit instruction in audience/purpose, the student will adapt tone and register appropriately in two different writing tasks with 80% accuracy.",
      "By the end of the IEP, the student will compose a college-application style personal statement draft including reflective content and clear organization on 3 of 4 attempts.",
      "Within the IEP period, when provided models and outlines, the student will generate thesis-support paragraphs with topic sentences and evidence in 4 of 5 activities.",
      "By the end of the IEP, given sentence-level focused interventions, the student will reduce grammatical errors by 50% from baseline across four measured samples."
    ],
    "Dyslexia Intervention": [
      "Within 12 months, given systematic phonics instruction, the student will segment and blend phonemes to decode multisyllabic words with 85% accuracy across 4 of 5 probes.",
      "By the end of the IEP, provided structured syllable instruction, the student will correctly decode closed-syllable and open-syllable words with 80% accuracy on weekly lists.",
      "Within the IEP period, when using explicit morphology lessons, the student will identify common prefixes and suffixes and derive word meanings with 80% accuracy across 4 of 5 assessments.",
      "By the end of the IEP, given repeated oral reading practice with feedback, the student will increase WCPM by 20% on grade-level passages across three consecutive probes.",
      "Within 12 months, when provided with structured spelling instruction, the student will spell targeted multisyllabic words with 85% accuracy across 4 of 5 dictation tasks.",
      "By the end of the IEP, during decoding drills, the student will apply syllable division rules to decode grade-level words with 90% accuracy in 3 of 4 lists.",
      "Within the IEP period, given explicit instruction in phonological awareness, the student will manipulate phonemes (add/delete) with 85% accuracy across 4 of 5 probes.",
      "By the end of the IEP, when provided Orton-Gillingham structured lessons, the student will read decodable texts with appropriate accuracy and phrasing on 3 of 4 passages.",
      "Within 12 months, given targeted fluency practice, the student will read grade-appropriate passages with 95% accuracy and correct prosody across 3 of 4 probes.",
      "By the end of the IEP, when taught explicit decoding strategies (chunking, syllable mapping), the student will apply strategies independently in 4 of 5 reading tasks.",
      "Within the IEP period, provided word study instruction, the student will generalize decoding skills to unfamiliar words with 80% accuracy across assessments.",
      "By the end of the IEP, when given multisensory activities, the student will improve phoneme-grapheme correspondence accuracy to 90% on weekly assessments.",
      "Within 12 months, given daily structured spelling practice, the student will show 80% retention of targeted spelling patterns across three consecutive weeks.",
      "By the end of the IEP, when given explicit instruction in morphology and roots, the student will break complex words into morphemes and explain meaning with 80% accuracy.",
      "Within the IEP period, during guided practice, the student will self-monitor reading errors and correct 75% of miscues independently across 4 of 5 sessions.",
      "By the end of the IEP, given scaffolded decoding supports, the student will read silently and answer comprehension questions with 80% accuracy for decodable texts.",
      "Within 12 months, when taught explicit orthographic patterns, the student will identify and apply common spelling patterns (e.g., silent e, doubling) with 85% accuracy.",
      "By the end of the IEP, given systematic syllable instruction, the student will accurately sort words by syllable type with 90% accuracy in 4 of 5 trials.",
      "Within the IEP, when provided with structured intervention, the student will improve automaticity for high-frequency irregular words to 95% accuracy across routines.",
      "By the end of the IEP period, during fluency-building interventions, the student will use phrasing and punctuation cues to read with expression in 3 of 4 opportunities.",
      "Within 12 months, given explicit vocabulary instruction integrated with decoding, the student will demonstrate meaning of tiered vocabulary words with 80% accuracy across 4 of 5 activities.",
      "By the end of the IEP, when provided multisensory spelling instruction, the student will reduce phonologically plausible errors by 50% from baseline across four measured samples.",
      "Within the IEP, during scaffolded reading comprehension lessons, the student will answer literal and inferential questions about decodable passages with 75% accuracy across 4 of 5 probes.",
      "By the end of the IEP period, provided Orton-style practice, the student will apply encoding strategies to spell new multisyllabic words with 80% success across 3 of 4 tasks.",
      "Within 12 months, when taught explicit blending and segmenting routines, the student will score at or above instructional level on phonics benchmark measures.",
      "By the end of the IEP, during structured phonemic practice, the student will delete or substitute phonemes in words with 85% accuracy on 4 of 5 probes.",
      "Within the IEP period, given cumulative review cycles, the student will maintain skill mastery for targeted patterns over three consecutive sessions.",
      "By the end of the IEP, when provided leveled decodables and teacher feedback, the student will progress one benchmark level in reading fluency.",
      "Within 12 months, when provided multisensory spelling and reading practice, the student will demonstrate improved decoding speed (words per minute) by 15% from baseline.",
      "By the end of the IEP, given scaffolded writing-to-read activities, the student will orthographically encode grade-appropriate words in connected writing with 80% accuracy on 3 of 4 samples."
    ],
    "Math": [
      "By the end of the IEP period, when given grade-level arithmetic problems, the student will accurately solve one-step and two-step computation problems with 80% accuracy across weekly probes.",
      "Within 12 months, given explicit instruction and visual models, the student will represent fractions using models and compare fractions with 80% accuracy on 4 of 5 tasks.",
      "By the end of the IEP, during guided practice, the student will solve multi-digit multiplication problems using standard algorithm with 85% accuracy across 3 of 4 assessments.",
      "Within 12 months, when using manipulatives and graphic organizers, the student will demonstrate understanding of decimals to hundredths with 80% accuracy on unit assessments.",
      "By the end of the IEP period, with scaffolded instruction, the student will solve rate and ratio problems with 70% accuracy across 4 of 5 problems.",
      "Within 12 months, given explicit modeling, the student will interpret data from graphs and tables and answer related questions with 80% accuracy on 3 of 4 tasks.",
      "By the end of the IEP, when provided practice in problem decomposition, the student will solve basic algebraic expressions evaluating variables with 75% accuracy across 4 of 5 quizzes.",
      "Within the IEP period, provided computation strategies, the student will demonstrate fluency with multiplication facts (0-12) with 90% accuracy across timed probes.",
      "By the end of the IEP, during math portfolio tasks, the student will explain solution steps using mathematical language in 4 of 5 assignments.",
      "Within 12 months, when given scaffolded practice, the student will solve one-variable linear equations with one operation with 75% accuracy across 4 of 5 problems.",
      "By the end of the IEP period, provided step-by-step instruction, the student will convert between fractions, decimals, and percentages with 80% accuracy on 3 of 4 assessments.",
      "Within 12 months, when taught estimation strategies, the student will estimate sums and differences within 10% of the actual answer on 80% of problems.",
      "By the end of the IEP, during calculation practice, the student will add and subtract integers correctly with 80% accuracy across 4 of 5 probes.",
      "Within 12 months, given visual supports, the student will solve basic geometry perimeter and area problems with 75% accuracy across tasks.",
      "By the end of the IEP period, when provided worked examples, the student will apply order of operations correctly on 85% of multi-step problems.",
      "Within the IEP, provided with concrete-representational-abstract models, the student will solve proportional reasoning items with 70% accuracy across checks.",
      "By the end of the IEP, given explicit modeling and scaffolds, the student will interpret coordinate plane points and plot simple ordered pairs with 90% accuracy in 3 of 4 tasks.",
      "Within 12 months, when provided math vocabulary instruction, the student will define and use 15 essential math terms in context with 80% accuracy across tasks.",
      "By the end of the IEP, during data analysis units, the student will calculate mean, median, mode, and range with 85% accuracy on 3 of 4 tasks.",
      "Within 12 months, given guided practice with word problems, the student will identify relevant information and necessary operations with 75% accuracy on weekly problems.",
      "By the end of the IEP period, when provided manipulatives and models, the student will demonstrate understanding of equivalent fractions with 80% accuracy across 4 of 5 tasks.",
      "Within 12 months, when taught multi-step strategies, the student will solve real-world applied math problems with 70% accuracy across 3 of 4 applications.",
      "By the end of the IEP, given timed computation drills and supports, the student will increase computation fluency to 80% accuracy within grade-level expectations.",
      "Within the IEP period, provided explicit instruction in problem-solving frameworks, the student will explain reasoning in 3 steps for multi-step problems in 3 of 4 instances.",
      "By the end of the IEP, when given scaffolds and calculation aids, the student will complete math assignments with 85% on-task behavior and 75% accuracy across weekly checks.",
      "Within 12 months, during algebra introduction, the student will represent numeric relationships using variables with 75% accuracy across 3 of 4 tasks.",
      "By the end of the IEP period, when given visual fraction models, the student will compare and order fractions with like and unlike denominators with 80% accuracy.",
      "Within 12 months, provided explicit instruction in rate and proportion problems, the student will solve unit-rate questions with 70% accuracy on 4 of 5 tasks.",
      "By the end of the IEP, when taught conversion strategies, the student will convert measurements (e.g., inches to feet) accurately in applied problems with 85% accuracy.",
      "Within the IEP period, given supports and repeated practice, the student will demonstrate improved problem-solving persistence and complete assigned math tasks on 4 of 5 occasions."
    ],
    "Math Calculation": [
      "Within 12 months, given timed computation practice with supports, the student will accurately solve 20 mixed operation problems (addition, subtraction, multiplication, division) in 5 minutes with 80% accuracy on 4 of 5 probes.",
      "By the end of the IEP period, during daily drills, the student will increase single-digit multiplication fluency to 95% accuracy across three consecutive measures.",
      "Within the IEP, when provided calculation strategies (e.g., chunking, decomposing), the student will solve two-digit by one-digit multiplication problems with 85% accuracy across tasks.",
      "By the end of the IEP, given stepwise instruction, the student will perform long division with a one-digit divisor with 80% accuracy on weekly assessments.",
      "Within 12 months, provided with calculators as accommodation when appropriate, the student will correctly set up and interpret calculator results for multi-step computation problems with 90% accuracy.",
      "By the end of the IEP, during mental math routines, the student will accurately compute sums to 20 without aids 9 of 10 trials.",
      "Within the IEP period, when given number line strategies, the student will add and subtract integers accurately with 85% accuracy across 4 of 5 probes.",
      "By the end of the IEP, provided scaffolded practice in fractions, the student will compute fraction addition with like denominators with 85% accuracy in 3 of 4 tasks.",
      "Within 12 months, given visual supports, the student will complete two-step computation problems involving fractions and decimals with 75% accuracy across checks.",
      "By the end of the IEP period, during timed fact practice, the student will achieve automaticity for addition and subtraction facts (0-20) with 90% accuracy.",
      "Within the IEP, when taught decomposition strategies, the student will accurately compute three-digit addition with carrying in 4 of 5 problems.",
      "By the end of the IEP, provided practice in multiplication facts using arrays and visual models, the student will improve recall to 90% accuracy across measures.",
      "Within 12 months, given scaffolded supports, the student will compute percent problems (e.g., find 25% of 80) with 75% accuracy on 3 of 4 assessments.",
      "By the end of the IEP period, when using algorithmic steps, the student will perform multi-digit subtraction with regrouping with 85% accuracy across tasks.",
      "Within the IEP, during calculator instruction, the student will interpret decimal computations and round appropriately with 90% accuracy on applied problems.",
      "By the end of the IEP, when given timed fluency practice, the student will increase the number of accurate digit-by-digit computations by 20% from baseline.",
      "Within 12 months, provided workplace-style problem sets, the student will perform unit conversions with 80% accuracy across measures.",
      "By the end of the IEP, using estimation strategies, the student will estimate sums and products within 10% of actual values with 80% accuracy in 3 of 4 tasks.",
      "Within the IEP period, when given direct modeling, the student will compute averages (mean) of small sets with 85% accuracy across tasks.",
      "By the end of the IEP, provided visual calculation templates, the student will correctly align multi-digit problems and compute accurately in 4 of 5 daily tasks.",
      "Within 12 months, given structured drills and mnemonic devices, the student will reduce calculation errors in grade-level tasks by 50% from baseline.",
      "By the end of the IEP period, using calculators for complex computations, the student will accurately interpret the result and verify reasonableness in 4 of 5 tasks.",
      "Within the IEP, when taught place value strategies, the student will demonstrate accurate computation in adding/subtracting decimals to hundredths with 85% accuracy across assessments.",
      "By the end of the IEP, during math stations, the student will accurately complete computational routines within allocated time 4 of 5 times.",
      "Within 12 months, given repeated modeling, the student will apply the distributive property to simplify multiplication and compute accurately on 3 of 4 tasks.",
      "By the end of the IEP period, when taught estimation and checking strategies, the student will self-check computation errors and correct 75% independently on 4 of 5 samples.",
      "Within the IEP, during fast fact practice, the student will increase speed while maintaining 85% accuracy on mixed-operation timed drills.",
      "By the end of the IEP, provided scaffolded practice, the student will compute ratio-related computations with 75% accuracy across 3 of 4 measures.",
      "Within 12 months, given differentiated drills, the student will demonstrate mastery of grade-level computational skills as measured by teacher-generated benchmarks.",
      "By the end of the IEP period, the student will independently choose and apply an appropriate computation strategy (estimation, algorithm, calculators) for word problems in 4 of 5 instances."
    ],
    "Word Problems": [
      "By the end of the IEP period, when given a word problem with one operation, the student will identify the operation and compute the solution with 80% accuracy across weekly probes.",
      "Within 12 months, provided explicit instruction in problem mapping (underline, draw, write), the student will model word problems using drawings or equations in 4 of 5 tasks.",
      "By the end of the IEP, when given two-step word problems, the student will correctly sequence steps and solve with 70% accuracy on 3 of 4 assessments.",
      "Within the IEP period, given scaffolds and equation templates, the student will write an equation to represent a word problem with 80% accuracy across problems.",
      "By the end of the IEP, during real-world application tasks, the student will solve multi-step money problems (making change, totals) with 75% accuracy across 3 of 4 tasks.",
      "Within 12 months, when taught RUDE (Read, Underline, Draw, Estimate) strategies, the student will independently apply the strategy to solve 4 of 5 word problems.",
      "By the end of the IEP period, given visual organizers, the student will identify irrelevant information and ignore it when solving word problems in 4 of 5 instances.",
      "Within the IEP, provided step-by-step scaffolds, the student will solve distance-rate-time word problems by sequencing operations correctly with 70% accuracy.",
      "By the end of the IEP, when using bar modeling supports, the student will represent comparison word problems visually and solve with 75% accuracy on 3 of 4 tasks.",
      "Within 12 months, given measurement conversion scaffolds, the student will solve unit conversion word problems (e.g., inches to feet) with 80% accuracy across checks.",
      "By the end of the IEP period, provided with graphic organizers, the student will break multi-step problems into sub-steps and solve each step accurately in 3 of 4 trials.",
      "Within the IEP, when provided with calculators for complex computation, the student will set up the problem and interpret results correctly on 4 of 5 tasks.",
      "By the end of the IEP, given repeated practice, the student will increase accuracy on two-step multiplication or division word problems to 75% across weekly probes.",
      "Within 12 months, when taught to identify keywords and operations, the student will select the appropriate mathematical operation in 85% of word problems in 4 of 5 sessions.",
      "By the end of the IEP period, provided with worked-example practice, the student will explain reasoning steps for solved word problems in 3 of 4 oral checks.",
      "Within the IEP, given gradual release and modeling, the student will solve ratio-based word problems and justify solutions with 70% accuracy across checks.",
      "By the end of the IEP, when provided supports for multi-step planning, the student will solve mixture or percent word problems with 65% accuracy on 3 of 4 tasks.",
      "Within 12 months, given explicit instruction in checking strategies, the student will verify answers using inverse operations in 4 of 5 problems.",
      "By the end of the IEP period, during project-based tasks, the student will apply proportional reasoning in context and produce accurate numerical solutions on 3 of 4 tasks.",
      "Within the IEP, when taught context translation strategies, the student will convert real-world scenarios into mathematical expressions with 75% accuracy.",
      "By the end of the IEP, provided with visual math tools, the student will solve multi-step time and scheduling word problems with 80% accuracy on 3 of 4 assignments.",
      "Within 12 months, given cumulative review, the student will solve two- and three-step mixture or rate problems with 70% accuracy in 3 of 4 trials.",
      "By the end of the IEP period, when taught to annotate and check work, the student will self-correct errors in word problems and improve accuracy by 20% from baseline.",
      "Within the IEP, during contextual math tasks, the student will use estimation and rounding to check reasonableness of answers in 4 of 5 problems.",
      "By the end of the IEP, given small-group instruction, the student will model percent increase/decrease problems and solve with 70% accuracy on 3 of 4 assessments.",
      "Within 12 months, when provided equation-building supports, the student will translate multi-step verbal descriptions into solvable algebraic expressions in 4 of 5 activities.",
      "By the end of the IEP period, with applied practice, the student will complete word-problem tasks within given time frames while maintaining at least 70% accuracy.",
      "Within the IEP, given scaffolds for reading comprehension of math text, the student will extract numerical information correctly from multi-paragraph problems in 4 of 5 samples.",
      "By the end of the IEP, when provided checklists, the student will set up a multi-step solution plan and follow it to completion on 4 of 5 tasks.",
      "Within 12 months, when taught a consistent problem-solving routine, the student will improve problem-solving independence by completing 3 of 4 tasks without prompts."
    ],
    "Science": [
      "By the end of the IEP period, during laboratory activities, the student will follow a multi-step procedure accurately and record results with 80% completeness on 3 of 4 labs.",
      "Within 12 months, when taught scientific vocabulary explicitly, the student will use 12 target science terms accurately in explanations across 4 of 5 tasks.",
      "By the end of the IEP, given graphic organizers, the student will compare and contrast ecosystems and correctly classify biotic and abiotic factors in 4 of 5 assignments.",
      "Within the IEP period, when provided modeling for data analysis, the student will interpret simple graphs and describe trends with 80% accuracy across 3 of 4 tasks.",
      "By the end of the IEP, during hands-on experiments, the student will make testable predictions and identify variables with 80% accuracy in 3 of 4 labs.",
      "Within 12 months, given scaffolded reading of science texts, the student will summarize a scientific passage using main idea and two supporting details on 4 of 5 checks.",
      "By the end of the IEP period, when given inquiry-based prompts, the student will design a simple experiment including materials and procedure with teacher support in 3 of 4 projects.",
      "Within 12 months, provided explicit instruction in measurement, the student will accurately measure and record length/mass/volume with correct units in 4 of 5 tasks.",
      "By the end of the IEP, during lab write-ups, the student will write clear conclusions that reference data and include explanation of results in 3 of 4 reports.",
      "Within the IEP period, when taught concept maps, the student will create accurate concept maps to show relationships between scientific concepts in 4 of 5 activities.",
      "By the end of the IEP, given supports for technical writing, the student will write a short scientific report with accurate procedure, results, and interpretation on 3 of 4 assignments.",
      "Within 12 months, when provided tiered questions, the student will analyze cause-and-effect relationships in scientific scenarios with 75% accuracy across 4 of 5 prompts.",
      "By the end of the IEP period, during group investigations, the student will contribute a data-driven observation and help graph results on 4 of 5 sessions.",
      "Within the IEP, given explicit instruction in experimental design, the student will identify independent, dependent, and controlled variables with 85% accuracy on 4 of 5 checks.",
      "By the end of the IEP, when given safety protocols instruction, the student will demonstrate correct laboratory safety behaviors in 100% of observed labs.",
      "Within 12 months, provided data-analysis templates, the student will calculate averages and identify outliers in small data sets with 80% accuracy across 3 of 4 tasks.",
      "By the end of the IEP period, when provided sentence frames, the student will write evidence-based scientific explanations using claim-evidence-reasoning on 3 of 4 assignments.",
      "Within the IEP, given scaffolded models, the student will explain energy transfer in a simple food chain using correct vocabulary in 4 of 5 activities.",
      "By the end of the IEP, during unit assessments, the student will demonstrate understanding of the scientific method steps with 80% accuracy.",
      "Within 12 months, when taught skills in data interpretation, the student will construct and label bar and line graphs correctly in 3 of 4 tasks.",
      "By the end of the IEP period, provided vocabulary supports, the student will identify key features of cells and their functions with 80% accuracy on 4 of 5 checks.",
      "Within the IEP, given guided labs, the student will test hypotheses and record evidence supporting or refuting the hypothesis in 3 of 4 sessions.",
      "By the end of the IEP, when taught scientific literacy strategies, the student will locate and paraphrase key information from science articles with 80% accuracy in 3 of 4 tasks.",
      "Within 12 months, given supports for math-science integration, the student will perform basic calculations related to density or speed with 80% accuracy across tasks.",
      "By the end of the IEP period, during project-based units, the student will present a short oral report summarizing research findings using visuals in 3 of 4 presentations.",
      "Within the IEP, when taught classification keys, the student will use dichotomous keys to identify organisms with 75% accuracy on 3 of 4 trials.",
      "By the end of the IEP, provided explicit instruction in weather/climate concepts, the student will explain differences and provide examples with 80% accuracy across 3 of 4 assessments.",
      "Within 12 months, when given cumulative review and supports, the student will maintain mastery of key science vocabulary across three consecutive quizzes.",
      "By the end of the IEP period, with scaffolds for experimental reflection, the student will analyze lab data to identify errors and propose reasonable improvements on 3 of 4 labs.",
      "Within the IEP, during environmental science units, the student will describe human impacts on ecosystems and propose two mitigation strategies with 75% accuracy."
    ]
  }
}